#include "IO.h"
#include "time.h"
#include "DATA.h"
#include "logic.h"
#include "OLED.h"
//******************************************************************************
//*
//*			OLED_POW  打开OLED屏幕供电，00-5V 01-5.5V 02-6V 03-6.5V
//*
//******************************************************************************
extern u16 Sleep_Queue_task[Sleep_queue_num];
extern u16 dat00[System_data_num];
//========================================================================
// 函数: void OLED_POW(u8 dat)
// 描述: OLED供电启动 0~3 为5/6/7/8V选择
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void OLED_POW(u8 dat)
{
    P53 = 1;
    P5M0 &= 0xf7; //p54双向
    P5M1 &= 0xf7;
    P05 = ~(dat & 0x01);
    P06 = ~(dat & 0x02);
}
//========================================================================
// 函数: void OLED_POW_LOW()
// 描述: OELD供电关闭
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void OLED_POW_LOW()
{
    P53 = 0;
    P5M0 |= 0x08;
    P5M1 |= 0x08;
    P05 = 1;
    P06 = 1;
}
//========================================================================
// 函数: void RESET54()
// 描述: P54位复位引脚
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void RESET54()
{
    P5M0 &= 0xed; //p54双向
    P5M1 &= 0xed;
    P54RST = 1;
}
//========================================================================
// 函数: void Clock_INT()
// 描述: RTC中断初始化
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Clock_INT()
{
//			P5M0 &= 0xfe; //p54双向
//			P5M1 &= 0xfe;
    P50 = 1;
    P5INTE |= 0x01;//允许端口中断
    P5IM1 =  0x00;//下降沿中断
    P5IM0 =  0x00;
    P5WKUE |= 0x01;//允许掉电唤醒


//			P5M0 &= 0xfe; //p54双向
//			P5M1 &= 0xfe;

//			P5M0 &= 0xFB; //初始化电池电压检测MOS控制开关
//			P5M1 &= 0xFB; //
}






//========================================================================
// 函数: void key_int()
// 描述: 按键初始化
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================

void key_int()
{
    //+
//	P4M0 &= 0x9f;
//	P4M1 &= 0x9f;

    P4INTE |= 0x60;//允许端口中断
    P4IM1 &=  0x9f;//下降沿中断
    P4IM0 &=  0x9f;

    P4WKUE |= 0x60;//允许掉电唤醒

//	P2M0 &= 0x3f;
//	P2M1 &= 0x3f;

    P2INTE |= 0xC0;//允许端口中断
    P2IM1 &=  0x3f;//下降沿中断
    P2IM0 &=  0x3f;

    P2WKUE |= 0xC0;//允许掉电唤醒

}

//========================================================================
// 函数: void Buzzer_Open()
// 描述: 蜂鸣器打开
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Buzzer_Open()
{
    P4M0 |= 0x01;
    P4M1 &= 0xFE;
    P40=1;
}
//========================================================================
// 函数: void Buzzer_Close()
// 描述: 蜂鸣器关闭
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Buzzer_Close()
{
    P4M0 |= 0x01;
    P4M1 |= 0x01;
    P40=0;
}


//========================================================================
// 函数: void Buzzer_falg_0020()
// 描述: 蜂鸣器任务，关闭蜂鸣器输出
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Buzzer_falg_0020()
{
    if(Sleep_Queue_task[0] & 0x0020)
    {
        dat00[0x0005] &= 0xFFFD;
        if(dat00[0x0005] == 0)  Buzzer_Close();
        Sleep_Queue_task[0] &=~0x0020;
    }
}

//========================================================================
// 函数: void Battery_ON_ON()
// 描述: 打开电池电压检测MOS控制开关
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Battery_ON_ON()
{
    P52 = 1;
    P5M0 |= 0x04; //初始化电池电压检测MOS控制开关
    P5M1 &= ~0x04; //
}
//========================================================================
// 函数: void Battery_ON_OFF()
// 描述: 关闭、初始化电池电压检测MOS控制开关
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Battery_ON_OFF()
{

    P5M0 |= 0x04; //初始化电池电压检测MOS控制开关
    P5M1 |= 0x04; //
    P52 = 0;
}





//========================================================================
// 函数: void ICacheOn(void)
// 描述: 打开ICACHE功能，STC官方例程
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void ICacheOn(void)     //打开ICACHE功能
{
    bit fEA;

    if(WTST > 0)
    {
        fEA = EA;
        EA = 0;         //关闭中断，防止写触发命令序列中途产生中断
        _nop_();
        _nop_();
        NOP40();
        TA = 0xaa;      //写入触发命令序列1
        //此处不能有其他任何指令
        TA = 0x55;      //写入触发命令序列2
        //此处不能有其他任何指令
        ICHECR = 0x01;  //写保护暂时关闭，可以修改ICHECR中的EN位
        //EN为再次进入写保护状态
        _nop_();
        _nop_();
        NOP40();
        EA = fEA;
    }
}
//========================================================================
// 函数: ICacheOff(void)
// 描述: 关闭ICACHE功能，STC官方例程
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void ICacheOff(void)//关闭ICACHE功能
{
    bit fEA;

    fEA = EA;
    EA = 0;         //关闭中断，防止写触发命令序列中途产生中断
    _nop_();
    _nop_();
    NOP40();
    TA = 0xaa;      //写入触发命令序列1
    //此处不能有其他任何指令
    TA = 0x55;      //写入触发命令序列2
    //此处不能有其他任何指令
    ICHECR = 0x00;  //写保护暂时关闭，可以修改ICHECR中的EN位
    //EN位再次进入写保护状态
    _nop_();
    _nop_();
    NOP40();
    EA = fEA;
}



//========================================================================
// 函数: IO_Init(void)
// 描述: IO初始化
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void IO_Init(void)
{

//*********************P0区*******************************
//
//  BMC050 DRDYO中断+  KEYSET + KEY+ 设置为双向口 默认高电平
//
//	（双向）P07 SPL06_INT        （开漏）P06 OLEDV1       （开漏）P05 OLEDV2    （高阻）P04 BATTERY（电池ADC采样脚）   （高阻）P03 ADC6（充电电流）   （开漏）PP02 EN（锂电池充电EN）   （高阻）P01 GHRG   （开漏）PP00 VIN/2

    P0M0 = 0x65;
    P0M1 = 0x7f;

//*********************P4区*******************************
//	P47 DRDYO        P46 KEYSET       P45 KEY+    P44 悬空   P43 悬空   P42 悬空   P41 悬空   P40 CCP0_EN（蜂鸣器控制）
    P4M0 = 0x1f;
    P4M1 = 0x1f;
    Buzzer_Close();


//*********************P1区*******************************
//	（双向）P17 INT3O        （开漏）P16 悬空       （双向）P15 SCL    （双向）P14 SDA   （双向）P13 INT2O    （开漏）P12   （开漏）P11 BH_INT   （开漏）P10 悬空
    P1M0 = 0x47;
    P1M1 = 0x47;
//		SCK = 0;
    P1PU = 0x30;//IIC上拉电阻



//*********************P3区*******************************
//	（双向）P37 INT3（BMC050）        （开漏）P36 悬空       （开漏）P35 悬空    （双向）P34 SW360   （开漏）P33 悬空    （开漏）P32 悬空     （开漏）P31 TX   （开漏）P30 RX
    P3M0 = 0x6f;
    P3M1 = 0x6f;

//*********************P5区*******************************
//	（开漏）P57         （开漏）P56        （开漏）P55     （双向）P54 RSET   （开漏）P53 5VEN    （开漏）P52 BATTERY_ON     （开漏）P51 TEXT  （双向）P50 SQW（1Hz）
    P5M0 = 0xee;
    P5M1 = 0xee;


//*********************P2区*******************************
//	（双向）P27  KEY-       （双向）P26  KEYMODE      （推挽）P25 SCLK    （开漏）P24 悬空   （推挽）P23 MOSI    （开漏）P22 CS     （双向）P21 DC  （双向）P20 RES
    CS =0;
    P2M0 = 0x3c;
    P2M1 = 0x14;

    P2SR = 0xd7;
    P2DR = 0xd7;



    P6M0 = 0xff;
    P6M1 = 0xff;

    P7M0 = 0xff;
    P7M1 = 0xff;

    //输入寄存器使能
    P0IE=0x1b;
    P1IE=0x30;
    P2IE=0xc0;
    P3IE=0x13;//0x10
    P4IE=0x60;
    P5IE=0x11;
    P6IE=0x00;
    P7IE=0x00;


}













