#include "logic.h"
#include "DATA.h"
#include "OLED.h"
#include "IO.h"
#include "SecondaryMenu.h"


extern u16 dat00[System_data_num];
extern u16 dat00_low[System_data_num];
extern u8 xdata dat00_flag[System_data_num];
extern u16 xdata dat00_max[System_data_num];


/****************************** 睡眠寄存器组 ***********************************/
extern u16 Sleep_Queue[Sleep_queue_num];
extern u16 Sleep_Queue_count;
extern u16 Sleep_Queue_count_target;
extern u16 Sleep_Queue_task[Sleep_queue_num];


extern u8 Time_New[7];
extern u8 Time_Low[7];
extern u8 xdata Time_int[7];




extern u16 jy;

u8 AlarmClock_SB_flag = 0;

u16 Sleep36 = 0;

u32 AlarmClock_low_Memory = 0;




void jump_MainMenu()     //跳到主菜单
{
    dat00[0x10] = 0;
    dat00_low[0x17] = dat00[0x17];
    dat00[GET_SC() + 0x0f] = dat00[0x17] % GET_SCdat();
    dat00_flag[0x10] = 1;
}

void jump_SecondaryMenu()     //跳到二级菜单
{
    dat00[0x10] = dat00[0x11]+1;
    dat00_flag[0x10] = 1;
    dat00[0x17] = (dat00[GET_SC()] << 1)+ dat00[GET_SC() + 0x0f];
    dat00[0x18] = dat00[0x17];
    dat00_low[0x17] = dat00[0x17];
    if(dat00[0x11] == 0x06)
    {
        GET_time_c();
        dat00[0x0086] = Date_restrictions1(dat00[0x0088] ,dat00[0x0087] ,dat00[0x0086],0x0086);
    }

}



//========================================================================
// 函数: SET_key()
// 描述: 按下确认
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void SET_key()     
{

//******************************************************************************
//*
//*			主菜单下，且不在三级菜单，按下确定，进入相应的二级菜单
//*
//******************************************************************************
    if((dat00[0x10] == 0x0000)  && dat00[0x1A] == 0 )
    {
				
        jump_SecondaryMenu();
				
    }
		//******************************************************************************
//*
//*			在TV模式时，按下确定按键支持快速查询
//*
//******************************************************************************
    else if(dat00[0x0010] == 0x0020 || dat00[0x0010] == 0x0021 || dat00[0x0010] == 0x0022)
    {
        dat00[0x10]=0x0022;
        dat00[0x002D] = 0;
        dat00_flag[0x10]=1;
    }
//******************************************************************************
//*
//*			系统信息界面，按下确认也是返回主菜单
//*
//******************************************************************************
    else if(dat00[0x10] == 0x000F && dat00[0x1A] == 0)
    {
        jump_MainMenu();
    }
//******************************************************************************
//*
//*			在二级菜单（且你在三级菜单）不可修改值按下确定
//*
//******************************************************************************
    else if((dat00_max[GET_SCdat3()] == 0x1001 ) && dat00[0x1A] == 0)
    {
        dat00[GET_SCdat3()] ^= 0x0001;
			  dat00_low[GET_SCdat3()] = dat00[GET_SCdat3()];
			  if(dat00[0x10] == 0x0001 && dat00[0x2F] == 0x0000) dat00_flag[0x0021] = 1;
				dat00[0]	|=0x0400;
				dat00[0]	|=0x0200;			
    }
//******************************************************************************
//*
		//*			（不在三级菜单下）按了不可修改的值
//*
//******************************************************************************		
    else if((dat00_max[GET_SCdat3()] & 0x0080 ) && dat00[0x1A] == 0)
    {
        if(dat00[0x10] == 0x0001 && dat00[0x2F] == 0x0005)//进入标准TV模式
        {
            dat00[0x10] = 0x0020;
            dat00[0x002D] = 0;
            dat00[0x37] = 0;
            dat00[0x26] = 1;
            dat00[0] &= ~0x0040;
					  dat00[0] &= ~0x0080;
            dat00_flag[0x10] = 1;
        }
        else if(dat00[0x10] == 0x0002 && dat00[0x3F] == 0x0006)//进入低功耗模式
        {

            dat00[0x37] = 1;//记住此时为低功耗模式
            dat00[0x26] = 0;
            dat00_flag[0x37] = 1;
					  dat00[0] &= ~0x0040;
        }
        else if(dat00[0x10] == 0x0007 && dat00[0x008F] == 0x0000)//设置时间
        {
            jump_MainMenu();
            dat00_flag[0x81] = 1;
        }
    }
//******************************************************************************
//*
//*			在二级菜单（且你在三级菜单、不是指南针菜单）按下确定，进入三级菜单
//*
//******************************************************************************
    else if(dat00[0x10] >= 0x0001 && dat00[0x10] <= 0x0010 && dat00[0x1A] == 0 && dat00[0x10] != 0x0005 && dat00[0x10] != 12)
    {
        dat00[0x1A] = 1;
        dat00_flag[0x10] = 1;
    }
//******************************************************************************
//*
//*			在三级菜单（非指南针菜单）按下确定，回到二级菜单
//*
//******************************************************************************
    else if(dat00[0x10] >= 0x0001 && dat00[0x10] <= 0x0010 && dat00[0x1A] == 1 && dat00[0x10] != 0x0005 && dat00[0x10] != 12)
    {
        if(dat00[0x10] == 0x0007 && ((dat00[0x008F] == 0x0006) ||  (dat00[0x008F] == 0x0007) ))//更改了年和月
        {
            dat00[0x0086] = Date_restrictions1(dat00[0x0088] ,dat00[0x0087] ,dat00[0x0086],0x0086);
        }
				dat00[0]	|=0x0200;
        dat00[0x1A] = 0;
        dat00_flag[0x10] = 1;
        dat00_low[GET_SCdat3()] = dat00[GET_SCdat3()];
    }
    else
    {
        jump_MainMenu();
    }
		dat00[0x0008] = 60;//无操作倒计时更新

}










//========================================================================
// 函数: void ESC_key()
// 描述: 按下退出
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void ESC_key()     //二级菜单 按下退出
{
    u8 pp = 0;
	
     if((dat00[0x10] >= 0x0001 && dat00[0x10] <= 0x0010 && dat00[0x1A] == 0) || (dat00[0x10] >= 0x0020 && dat00[0x10] <= 0x0022))//在二级菜单，跳回主菜单
    {
        dat00_low[0x0010] = dat00[0x0010];
        jump_MainMenu();

    }
    else if(dat00[0x10] >= 0x0001 && dat00[0x10] <= 0x0010 && dat00[0x1A] == 1)//三级菜单，跳回主菜单
    {
        dat00[0x1A] = 0;
        dat00_flag[0x10] = 1;
        dat00[GET_SCdat3()] = dat00_low[GET_SCdat3()];
        dat00_flag[GET_SCdat3()] = 1;
        jy=0;
    }
    else
    {
        jump_MainMenu();

    }
    dat00[0x0008] = 60;//无操作倒计时更新
}

//========================================================================
// 函数: void Add_key(u8 a) 
// 描述: 按下+ -
// 参数: a： 1是加 0是减
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void Add_key(u8 a)   //主菜单 按下+
{
    if(dat00[0x10] == 0x0005)//指南针按下，清除校准数据
    {
        dat00[0x0064] = 0;
        dat00_low[0x0064] = 0;
        dat00[0x0065] = 0;
        dat00_low[0x0065] = 0;
        dat00[0x0066] = 0;
        dat00_low[0x0066] = 0;
        dat00[0x0067] = 0;
        dat00_low[0x0067] = 0;
			  dat00[0x0069] = 0;
			  dat00[0x006A] = 0;
    }
		else if(dat00[0x10] == 12)//手电筒按下，加减电压
		{
		    data00_Change(0x0052,a);
		    dat00_flag[0x0052] = 1;
		}
    else if(dat00[0x10] == 0x0000 && dat00[0x1A] == 0)//主菜单按下，加减主菜单光标
    {
        data00_Change(0x14,a);
    }
    else if(dat00[0x10] > 0 && dat00[0x10] < 16 && dat00[0x1A] == 0)//二级菜单按下，加减主菜单二级光标
    {
        data00_Change(0x17,a);
    }
    else if(dat00[0x1A] == 1)
    {
        //data00_Change((u8)GET_SCdat3(),a);
    }


    if(dat00[0x0010] == 0x0020 || dat00[0x0010] == 0x0021 || dat00[0x0010] == 0x0022)//TV模式快速查询
    {
        if(a)
        {
            dat00[0x10]=0x0021;
            dat00[0x002D] = 0;
            dat00_flag[0x10]=1;
        }
        else
        {
            dat00[0x10]=0x0020;
            dat00[0x002D] = 0;
            dat00_flag[0x10]=1;
        }
    }
    dat00[0x0008] = 60;//无操作倒计时更新





}

//========================================================================
// 函数: void key_thread1_new()
// 描述: 按键声音触发
// 参数: 
// 返回:
// 版本: V1.0 2023.02.05
//========================================================================
void key_thread1_new()
{
    if(dat00[0] & 0x0001)
    {

        SleepQueue_aheadW1(6,0x0101,0);


        if(dat00[0xC3] == 1)
        {
            if(dat00[0xC1] == 1)
            {
                Buzzer_Open();
                SleepQueue_aheadW1(dat00[0xC2],0x0020,0);
							
            }
        }
        dat00[0] &= ~0x0001;
    }
}













